/*
 BOJ-15903
 석환이는 아기다. 아기 석환이는 자연수가 쓰여져있는 카드를 갖고 다양한 놀이를 하며 노는 것을 좋아한다. 오늘 아기 석환이는 무슨 놀이를 하고 있을까? 바로 카드 합체 놀이이다!
 아기 석확이는 자연수가 쓰여져 카드를 n장 갖고 있다. 처음에 i번 카드엔 ai가 쓰여있다. 카드 합체놀이는 이 카드들을 합체하며 노는 놀이이다. 카드 합체는 다음과 같은 과정으로 이루어진다.
 1. x번 카드와 y번 카드를 골라 그 두 장에 쓰여진 수를 더한 값을 계산한다. (x!= y)
 2. 계산한 값을 x번 카드와 y번 카드 두 장 모두에 덮어 쓴다.
 이 카드 합체를 총 m번 하면놀이가 끝난다. m번의 합체를 모두 끝낸 뒤, n장의 카드에 쓰여있는 수를 모두 더한 값이 이 놀이의 점수가 된다. 이 점수를 가장 작게 만드는 것이 놀이의 목표이다.
 아기 석환이는 수학을 좋아하긴 하지만, 아직 아기이기 때문에 점수를 얼마나 작게 만들 수 있는 지를 알 수는 없었다.(어른 석환이는 당연히 쉽게 알 수 있다) 그래서 문제 해결 능력이 뛰어난 여러분에게 도움을 요청했다. 만들 수 있는 가장 작은 점수를 계산하는 프로그램을 만들어보자
 ------------------------------------------------------------------------------------------------------------------------------
 풀이 :
 1. n개 입력 이후 퀵정렬(nlogn) 실행 시간
 2. 인덱스 1, 2번에 대해 연산 실시
 3. 1~2과정을 m번 반복
*/

#include <iostream>
#include <algorithm>

using namespace std;

long long int arr[1000005];

int main()
{
    ios::sync_with_stdio(false);
    cin.tie(NULL);
    cout.tie(NULL);
    
    int n, m;
    cin >> n >> m;
    
    for (int i = 0; i < n; i++)
        cin >> arr[i];
    
    for (int i = 0; i < m; i++)
    {
        sort(arr, arr + n);
        long long int temp = arr[0] + arr[1];
        arr[0] = temp; arr[1] = temp;
    }
    
    long long int score = 0;
    for (int i = 0; i < n; i++)
        score = score + arr[i];
    
    cout << score;
    
    return 0;
}
