/*
문제 : n개의 자연수와 자연수 m이 주어졌을 때, 아래 조건을 만족하는 길이가 m인 수열을 모두 구하는 프로그램을 작성하시오. n개으 자연수는 모두 다른 수 이다.
 1. n개의 자연수 중에서 m개를 고른 수열
 2. 같은 수를 여러 번 골라도 된다.
--------------------------------------------------------------------------------------------------------------------------------
입력 : 첫째 줄에 n과 m이 주어진다. (1 ≤ M ≤ N ≤ 7) 둘째 줄에 n개의 수가 주어진다. 입력으로 주어지는 수는 10,000보다 작거나 같은 자연수이다.
출력 : 한 줄에 하나씩 문제의 조건을 만족하는 수열을 출력한다. 중복되는 수열을 여러 번 출력하면 안 되며, 각 수열은 공백으로 구분해서 출력해야 한다.
 수열은 사전 순으로 증가하는 순서로 출력해야 한다.
--------------------------------------------------------------------------------------------------------------------------------
풀이 : "같은 수를 중복으로 골라도 된다" + "중복되는 수열을 여러 번 출력하면 안되며" 이기에 같은 수로 수열을 조합해도 된다. 그러기에 visted 방문 표시를 하여 중복된 수를 조합하여 수열을 만드는 과정을 생략하였다.
*/

#include <iostream>
#include <algorithm>
#define MAX 10

using namespace std;

int n, m;
int arr[MAX], answer[MAX];
void func(int k)
{
    if (k == m)
    {
        for (int i = 0; i < m; i++)
            cout << answer[i] << ' ';
        cout << '\n';
        
        return;
    }
    
    for (int i = 0; i < n; i++)
    {
        answer[k] = arr[i];
        func(k + 1);
    }
}

int main()
{
    ios::sync_with_stdio(false);
    cin.tie(NULL);
    cout.tie(NULL);
    
    cin >> n >> m;
    for (int i = 0; i < n; i++)
        cin >> arr[i];
    
    sort(arr, arr + n);
    func(0);
    
    return 0;
}
