/*
문제 : n개의 자연수와 자연수 m이 주어졌을 때, 아래 조건을 만족하는 길이가 m인 수열을 모두 구하는 프로그램을 작성하시오, n개의 자연수는 모두 다른 수이다.
-> n개의 자연수 중에서 m개를 고른 수열

---------------------------------------------------------------------------------------------------------------------------------
입력 : 첫째 줄에 n과 m이 주어진다. (1 <= M <= N <= 8)
 둘째 줄에 n개의 수가 주어진다. 입력으로 주어지는 수는 10,000보다 작거나 같은 자연수이다.
출력 : 한 줄에 하나씩 문제의 조건을 만족하는 수열을 출력한다. 중복되는 수열을 여러 번 출력하며 안되며, 각 수열은 공백으로 구분해서 출력해야 한다.
 수열은 사전 순으로 증가하는 순서로 출력해야 한다.
---------------------------------------------------------------------------------------------------------------------------------
풀이 : n과 m이 주어지고 n개의 임의의 정수가 주어진다. 이 정수는 정렬이 되어 있지 않은 상태이니 먼저 입력을 받은 직후 정렬을 하는 게 우선이라고 생각했다. 이후 정렬된 숫자를 기반으로 백트래킹으로 수열을 조합하였다. 조합된 수열은 answer 배열에 담아 둔 이후 꽉 찬 경우 바로 출력하는 형식으로 풀이했다.
*/
#include <iostream>
#include <algorithm>

#define MAX 10

using namespace std;

int n, m;
int arr[MAX], answer[MAX];
bool vis[MAX];

void func(int k)
{
    if (k == m)
    {
        for (int i = 0; i < m; i++)
            cout << answer[i] << ' ';
        cout << '\n';
        
        return;
    }
    
    for (int i = 0; i < n; i++)
    {
        if (!vis[i])
        {
            answer[k] = arr[i];
            vis[i] = true;
            func(k + 1);
            vis[i] = false;
        }
    }
}

int main()
{
    ios::sync_with_stdio(false);
    cin.tie(NULL);
    cout.tie(NULL);
    
    cin >> n >> m;
    for (int i = 0; i < n; i++)
        cin >> arr[i];
    
    sort(arr, arr + n);
    
    func(0);
    
    return 0;
}
